Tekla Open API Reference for Tekla Structures 2025
CannotGetAttributeForPluginDueToInexistantFieldException Class
 The CannotGetAttributeForPluginDueToInexistantFieldException class defines the exception that is thrown when Plugin.GetAttribute is called but the field does not exist.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToInexistantFieldException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotGetAttributeForPluginDueToInexistantFieldException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotGetAttributeForPluginDueToInexistantFieldException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotGetAttributeForPluginDueToInexistantFieldException type exposes the following members.
Constructors
Name | Description
CannotGetAttributeForPluginDueToInexistantFieldException
 Creates a new CannotGetAttributeForPluginDueToInexistantFieldException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace